yunsmall/usbipdcpp_esp32/components/usbipdcpp/src/esp32_handler/Esp32Server.cpp
#include "esp32_handler/Esp32Server.h"

#include <usbipdcpp/Session.h>
#include <usb/usb_helpers.h>
#include <esp_log.h>

#include <print>
#include <iostream>

#include <esp_pthread.h>

#include "esp32_handler/Esp32DeviceHandler.h"
#include "esp32_handler/tools.h"

const char *usbipdcpp::Esp32Server::TAG = "esp32_uspipdcpp_server";

usbipdcpp::Esp32Server::Esp32Server():
    host_client_handle(nullptr) {
    server.register_session_exit_callback([this]() {
        this->on_session_exit();
    });
}

void usbipdcpp::Esp32Server::init_client() {
    const usb_host_client_config_t client_config = {
            .max_num_event_msg = 15,
            .async = {
                    .client_event_callback = client_event_callback,
                    .callback_arg = this,
            }
    };

    auto err = usb_host_client_register(&client_config, &host_client_handle);
    ESP_LOGI(TAG, "client register status: %d", err);
    ESP_ERROR_CHECK(err);
}

void usbipdcpp::Esp32Server::client_event_callback(const usb_host_client_event_msg_t *event_msg, void *arg) {
    auto this_server = static_cast<Esp32Server *>(arg);
    if (event_msg->event == USB_HOST_CLIENT_EVENT_NEW_DEV) {
        spdlog::info("A new device detect in address {}", event_msg->new_dev.address);
        usb_device_handle_t dev_handle;
        auto err = usb_host_device_open(this_server->host_client_handle, event_msg->new_dev.address, &dev_handle);
        if (err != ESP_OK) {
            SPDLOG_ERROR("Failed to open USB device in address {}: {}", event_msg->new_dev.address,
                         esp_err_to_name(err));
        }
        else {
            std::lock_guard lock(this_server->all_host_devices_mutex);
            // NEW_DEV 对每个枚举成功的设备只投递一次（usb_host 枚举完成路径，
            // usbh.c），设备地址全局递增不复用，同一 address 不会重复出现，
            // 无需重复绑定检查（防御性检查无触发场景）
            this_server->host_devices[event_msg->new_dev.address] = dev_handle;
            // 回滚绑定中途失败（如 OOM 异常）的接口与句柄：接口可能已部分
            // claim、句柄未关闭。先 release 全部接口再 close——usb_host_device_close
            // 对仍有 claim 接口的设备返回 ESP_ERR_INVALID_STATE，必须先释放
            auto rollback_bind = [&]() {
                const usb_config_desc_t *cfg = nullptr;
                if (usb_host_get_active_config_descriptor(dev_handle, &cfg) == ESP_OK && cfg) {
                    for (int intf_i = 0; intf_i < cfg->bNumInterfaces; intf_i++) {
                        int intf_offset;
                        auto intf_desc = usb_parse_interface_descriptor(cfg, intf_i, 0, &intf_offset);
                        if (!intf_desc)
                            continue;
                        usb_host_interface_release(this_server->host_client_handle, dev_handle,
                                                   intf_desc->bInterfaceNumber);
                    }
                }
                usb_host_device_close(this_server->host_client_handle, dev_handle);
            };
            esp_err_t bind_ret;
            try {
                bind_ret = this_server->bind_host_device(dev_handle);
            }
            catch (const std::exception &e) {
                // C 回调边界：异常逃逸到 usbh（C 代码）是未定义行为，必须
                // 就地消化。bind 内部只在错误路径 close 句柄，异常路径由
                // 上方 rollback 补齐
                SPDLOG_ERROR("绑定设备时异常：{}", e.what());
                rollback_bind();
                bind_ret = ESP_FAIL;
            }
            catch (...) {
                SPDLOG_ERROR("绑定设备时未知异常");
                rollback_bind();
                bind_ret = ESP_FAIL;
            }
            if (bind_ret != ESP_OK) {
                // 绑定失败（含异常回滚路径）：句柄已关闭，从 map 移除，
                // 防止设备拔除时 remove_gone_device 对已关闭句柄误操作
                this_server->host_devices.erase(event_msg->new_dev.address);
            }
        }
    }
    else {
        spdlog::info("A device with handle {} has gone", static_cast<void *>(event_msg->dev_gone.dev_hdl));
        this_server->remove_gone_device(event_msg->dev_gone.dev_hdl);

        // 无需等待 session 线程退出：usbh 在 DEV_GONE 消息进入 client 队列
        // 之前已把所有传输回调派发完毕（usbh_process 动作顺序 EPn_HALT_FLUSH
        // 先于 PROP_GONE_EVT，回调先于 device_removed_ 置位完成），session 的
        // 传输侧已无活动，其退出路径不触碰 usb 句柄。此处的 release/close 是
        // ESP-IDF 对 DEV_GONE 事件的标准清理流程

        const usb_config_desc_t *active_config_desc = nullptr;
        auto err = usb_host_get_active_config_descriptor(event_msg->dev_gone.dev_hdl, &active_config_desc);
        if (err == ESP_OK) {
            spdlog::info("尝试释放{}的所有接口", static_cast<void *>(event_msg->dev_gone.dev_hdl));
            for (int intf_i = 0; intf_i < active_config_desc->bNumInterfaces; intf_i++) {
                int intf_offset;
                auto intf_desc = usb_parse_interface_descriptor(active_config_desc, intf_i, 0, &intf_offset);
                if (!intf_desc)
                    continue;
                // release 的第三参数是 bInterfaceNumber（接口号），
                // 跳号接口用数组下标会释放错误的接口
                err = usb_host_interface_release(this_server->host_client_handle, event_msg->dev_gone.dev_hdl,
                                                 intf_desc->bInterfaceNumber);
                if (err != ESP_OK) {
                    SPDLOG_ERROR("释放设备接口{}时出错: {}", intf_desc->bInterfaceNumber, esp_err_to_name(err));
                }
            }

            err = usb_host_device_close(this_server->host_client_handle, event_msg->dev_gone.dev_hdl);
            if (err != ESP_OK) {
                SPDLOG_ERROR("Failed to close USB device handle {}: {}",
                             static_cast<void *>(event_msg->dev_gone.dev_hdl),
                             esp_err_to_name(err));
            }
            else {
                spdlog::info("成功关闭device句柄{}", static_cast<void *>(event_msg->dev_gone.dev_hdl));
            }
        }
        else {
            SPDLOG_ERROR("无法获取设备活动配置描述符：{}", esp_err_to_name(err));
        }

    }
}

esp_err_t usbipdcpp::Esp32Server::bind_host_device(usb_device_handle_t dev) {
    usb_device_info_t dev_info;
    auto err = usb_host_device_info(dev, &dev_info);
    if (err != ESP_OK) {
        spdlog::warn("无法获取设备信息，忽略这个设备：{}", esp_err_to_name(err));
        // 失败统一关闭句柄，否则设备一直被占用无法重新绑定
        usb_host_device_close(host_client_handle, dev);
        return err;
    }

    const usb_device_desc_t *device_descriptor = nullptr;
    err = usb_host_get_device_descriptor(dev, &device_descriptor);
    if (err != ESP_OK) {
        spdlog::warn("无法获取设备描述符，忽略这个设备：{}", esp_err_to_name(err));
        usb_host_device_close(host_client_handle, dev);
        return err;
    }

    const usb_config_desc_t *active_config_desc = nullptr;
    err = usb_host_get_active_config_descriptor(dev, &active_config_desc);
    if (err) {
        spdlog::warn("无法获取设备当前的配置描述符，忽略这个设备：{}", esp_err_to_name(err));
        usb_host_device_close(host_client_handle, dev);
        return err;
    }

    SPDLOG_DEBUG("该设备有{}个interface", active_config_desc->bNumInterfaces);
    std::vector<UsbInterface> interfaces;
    for (auto intf_i = 0; intf_i < active_config_desc->bNumInterfaces; intf_i++) {
        [[maybe_unused]] auto alter_setting_num = usb_parse_interface_number_of_alternate(active_config_desc, intf_i);
        SPDLOG_DEBUG("第{}个interface有{}个altsetting", intf_i, alter_setting_num);

        int intf_offset;
        auto intf_desc = usb_parse_interface_descriptor(active_config_desc, intf_i, 0, &intf_offset);
        if (!intf_desc)
            continue;
        //只使用第一个alsetting
        // claim 的第三参数是 bInterfaceNumber（接口号）而非数组下标：
        // usbh 内部按 intf_desc->bInterfaceNumber 匹配接口对象（usbh.c 的
        // interface_claim），跳号接口（如只有 0 和 2）用下标会指向不存在的接口
        err = usb_host_interface_claim(host_client_handle, dev, intf_desc->bInterfaceNumber, 0);
        if (err != ESP_OK) {
            SPDLOG_ERROR("无法声明接口{}：{}", intf_desc->bInterfaceNumber, esp_err_to_name(err));
            // 回滚之前已成功声明的接口，否则它们会被永久占用
            for (auto claimed_i = 0; claimed_i < intf_i; claimed_i++) {
                int claimed_offset;
                auto claimed_intf = usb_parse_interface_descriptor(active_config_desc, claimed_i, 0, &claimed_offset);
                if (!claimed_intf)
                    continue;
                auto rel_ret = usb_host_interface_release(host_client_handle, dev, claimed_intf->bInterfaceNumber);
                if (rel_ret != ESP_OK) {
                    SPDLOG_ERROR("回滚释放接口{}失败: {}", claimed_intf->bInterfaceNumber, esp_err_to_name(rel_ret));
                }
            }
            usb_host_device_close(host_client_handle, dev);
            return err;
        }

        std::vector<UsbEndpoint> endpoints;
        endpoints.reserve(intf_desc->bNumEndpoints);
        for (auto ep_i = 0; ep_i < intf_desc->bNumEndpoints; ep_i++) {
            int endpoint_offset = intf_offset;
            auto ep_desc = usb_parse_endpoint_descriptor_by_index(intf_desc, ep_i, active_config_desc->wTotalLength,
                                                                  &endpoint_offset);
            endpoints.emplace_back(
                    ep_desc->bEndpointAddress,
                    ep_desc->bmAttributes,
                    ep_desc->wMaxPacketSize,
                    ep_desc->bInterval
                    );
        }
        interfaces.emplace_back(
                UsbInterface{
                        .interface_class = intf_desc->bInterfaceClass,
                        .interface_subclass = intf_desc->bInterfaceSubClass,
                        .interface_protocol = intf_desc->bInterfaceProtocol,
                        // 跳号接口（如只有接口 0 和 2）时下标≠接口号，必须按
                        // 描述符的 bInterfaceNumber 填充，SET_INTERFACE 才匹配正确
                        .interface_number = intf_desc->bInterfaceNumber,
                        // endpoints 按 altsetting 分组，这里只使用第一个 altsetting（alt 0）
                        .endpoints = {std::move(endpoints)}
                }
                //直接全用libusb控制，不用走端口
                // .with_handler<LibusbInterfaceHandler>()
                );
    }

