yunsmall/usbipdcpp_esp32/components/usbipdcpp/src/esp32_handler/Esp32Server.cpp
}

usbipdcpp::Esp32Server::~Esp32Server() {
}

void usbipdcpp::Esp32Server::on_session_exit() {
    std::lock_guard lock(server.get_devices_mutex());
    auto &server_using_devices = server.get_using_devices();
    for (auto it = server_using_devices.begin(); it != server_using_devices.end();) {
        if (auto handler = it->second->handler) {
            if (handler->is_device_removed()) {
                it = server_using_devices.erase(it);
                continue;
            }
        }
        ++it;
    }
}

void usbipdcpp::Esp32Server::remove_gone_device(usb_device_handle_t dev) {
    std::lock_guard lock(all_host_devices_mutex);
    auto find_ret = std::find_if(host_devices.begin(), host_devices.end(),
                                 [&](const auto &item) {
                                     return item.second == dev;
                                 });
    if (find_ret != host_devices.end()) {
        host_devices.erase(find_ret);
        SPDLOG_TRACE("成功从所有设备中移除拔除的设备");
        // busid 是 bind 时缓存在 UsbDevice 里的端口拓扑字符串（见 tools.h
        // esp32_get_device_busid）。设备已移除，不能按 handle 重建 busid（父
        // 设备 device_t 可能已释放，递归访问是 UAF），改为按 native_handle
        // 直接匹配对象，busid 无需在移除路径重新生成
        std::lock_guard lock2(server.get_devices_mutex());
        auto &server_available_devices = server.get_available_devices();
        for (auto i = server_available_devices.begin(); i != server_available_devices.end(); ++i) {
            if (auto esp32_handler = std::dynamic_pointer_cast<Esp32DeviceHandler>((*i)->handler);
                esp32_handler && esp32_handler->native_handle == dev) {
                // 此处可以删除设备，因为此时因其还处于可用设备，因此没有session正在处理这个设备
                server_available_devices.erase(i);
                spdlog::info("从可用设备中移除目标设备");
                return;
            }
        }
        SPDLOG_WARN("可使用的设备中无目标设备");
        auto &server_using_devices = server.get_using_devices();
        for (auto i = server_using_devices.begin(); i != server_using_devices.end(); ++i) {
            if (auto esp32_handler = std::dynamic_pointer_cast<Esp32DeviceHandler>(i->second->handler);
                esp32_handler && esp32_handler->native_handle == dev) {
                // 通过 AbstDeviceHandler 接口通知
                esp32_handler->on_device_removed();
                // 强制关闭 Session
                SPDLOG_WARN("正在使用的设备被拔出，强制关闭 Session: {}", i->first);
                esp32_handler->trigger_session_stop();
                return;
            }
        }
    }
}

std::vector<usbipdcpp::Esp32Server::DeviceSnapshot> usbipdcpp::Esp32Server::list_device_snapshots() {
    std::vector<DeviceSnapshot> out;
    // 持锁快照：available/using 两容器分别对应“空闲可共享”与“被客户端占用”，
    // 与设备插拔/session 启停的写路径互斥，保证读到一致的两组数据
    std::lock_guard lock(server.get_devices_mutex());
    for (auto &device: server.get_available_devices()) {
        out.push_back(DeviceSnapshot{
                .busid = device->busid,
                .vendor_id = device->vendor_id,
                .product_id = device->product_id,
                .in_use = false,
        });
    }
    for (auto &[busid, device]: server.get_using_devices()) {
        out.push_back(DeviceSnapshot{
                .busid = busid,
                .vendor_id = device->vendor_id,
                .product_id = device->product_id,
                .in_use = true,
        });
    }
    return out;
}
